app/Http/Controllers/ProductController.php

select * from `products`
---
    public function index()
    {
        $all = ['products' => Product::all()];